Repository: OneStepRND/onestep-uikit-kmp
Catalog: uikit-kmp/OSTUIKitKMP/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: he, ro

source: Tags:
he: תגים:
ro: Теги:

source: Tap
he: הקישו
ro: Нажмите

source: Tap Always
he: הקישו ‘תמיד’
ro: Выберите Всегда

source: Tap While Using the App
he: הקישו ״בעת שימוש באפליקציה״
ro: Выберите При использовании приложения

source: Temporal
he: זמני
ro: Временной

# textToSpeechVoiceLanguage
source: en-US
he: he-IL
ro: ru-RU

source: Thank you for completing this measurement
he: תודה שהשלמת מדידה זו
ro: Спасибо за выполнение этого измерения

source: The app will let you know when 2 minutes are over — no need to track time.
he: האפליקציה תודיע לכם כש-2 דקות נגמרות - אין צורך לעקוב אחר הזמן.
ro: Приложение сообщит, когда пройдут 2 минуты — не нужно следить за временем.

source: The app will let you know when 6 minutes are over — no need to track time.
he: האפליקציה תודיע לכם כש-6 דקות נגמרות - אין צורך לעקוב אחר הזמן.
ro: Приложение сообщит вам, когда истекут 6 минут — не нужно отслеживать время

source: The entered hallway length is below recommended clinical guidelines (%@). A shorter hallway may result in additional turns that can affect clinical interpretation.
he: אורך המסדרון שהוזן נמוך מההנחיות הקליניות המומלצות (%@). מסדרון קצר יותר עשוי לגרום לסיבובים נוספים שעלולים להשפיע על הפרשנות הקלינית.
ro: Введённая длина коридора короче стандартной рекомендации (%@). Рассмотрите возможность использования более длинного прохода, если это возможно.

source: The full analysis couldn't be generated due to a system issue.
he: לא ניתן היה ליצור את הניתוח המלא עקב בעיית מערכת.
ro: Не удалось сгенерировать полный анализ из-за системной ошибки.

source: We couldn't apply your changes. Please try again.
he: לא הצלחנו להחיל את השינויים שלך. אנא נסו שוב.
ro: Nu am putut aplica modificările. Vă rugăm să încercați din nou.

source: The phone rang
he: הטלפון צלצל
ro: Зазвонил телефон

source: The recording will begin after the voice instructions
he: ההקלטה תתחיל לאחר הוראות הקול
ro: Запись начнется после голосовых инструкций

source: The room was relatively dark
he: החדר היה כהה יחסית
ro: В помещении было довольно темно

source: The sum of the measurement breakdown may exceed the measurement duration due to overlap between the different parts.
he: סכום פירוט המדידה עשוי לחרוג ממשך המדידה עקב חפיפה בין החלקים השונים.
ro: Сумма разбивки измерений может превысить продолжительность измерения из-за наложения различных частей.

source: The surface was uneven
he: המשטח לא היה ישר
ro: Поверхность была неровной

source: The time is measured from the moment you stand up from the chair until you sit back down.
he: הזמן נמדד מרגע הקימה מהכיסא ועד הישיבה חזרה.
ro: Время измеряется с момента подъема со стула до момента, когда вы снова сядете.

source: Then, slide the stop button.
he: לאחר מכן, החליקו את כפתור הסיום.
ro: Затем сдвиньте кнопку остановки

source: There was a problem connecting to the server - please try again later.
he: הייתה בעיה בהתחברות לשרת - אנא נסה שוב מאוחר יותר.
ro: Возникла проблема с подключением к серверу - пожалуйста, повторите попытку позже.

source: There were distracting background noises
he: היו רעשי רקע מסיחים
ro: Имелись отвлекающие фоновые шумы

source: This activity will ask you to walk for 60 seconds at your normal comfortable pace, and at the same time, count backwards by 3 from a number we provide.
he: פעילות זו תבקש ממך ללכת למשך 60 שניות בקצב הנוח הרגיל שלכם, ובאותו זמן, לספור לאחור ב-3 ממספר שאנו מספקים.
ro: Это упражнение попросит вас идти в течение 60 секунд в вашем обычном, комфортном темпе и одновременно считать в обратном порядке по 3 от предоставленного нами числа.

source: This App
he: אפליקציה זו
ro: Это приложение

source: This measurement's recording was too short
he: המדידה הייתה קצרה מדי
ro: Запись этого измерения была слишком короткой

source: This walk was partially analyzed
he: הליכה זו נותחה חלקית
ro: Эта прогулка была проанализирована частично

source: Timed Up and Go
he: זמן קום ולך
ro: Встать и идти

source: to analyze your movement and measure your progress.
he: לנתח את התנועה שלכם ולעקוב אחר ההתקדמות שלכם.
ro: для анализа ваших движений и измерения прогресса.

source: To perform this test, grant access to the microphone
he: כדי לבצע בדיקה זו, אפשר גישה למיקרופון
ro: Чтобы выполнить этот тест, предоставьте доступ к микрофону

source: Total assistance
he: סיוע מלא
ro: Полная помощь

source: Track your step count
he: עקוב אחר ספירת הצעדים שלכם
ro: Отслеживайте количество шагов

source: Try again
he: נסו שוב
ro: Попробовать снова

source: Try to walk continuously throughout each trial by turning at the ends of your path, as if you are walking around a cone.
he: נסה ללכת ברציפות לאורך כל ניסוי על ידי פנייה בקצוות המסלול שלכם, כאילו אתם הולכים סביב חרוט.
ro: Старайтесь идти непрерывно во время всего теста, разворачиваясь в конце маршрута, как будто обходите вокруг конуса.

source: Turn around at each end of the hallway or marked walking area.
he: הסתובב בכל קצה של המסדרון או אזור ההליכה המסומן.
ro: Разворачивайтесь на каждом конце коридора или обозначенной зоны ходьбы.

source: Turn location access back on to analyze your walks, even when the app is closed, for the most accurate, real-life insights.
he: הפעילו מחדש את גישת המיקום כדי לנתח את ההליכות שלכם, גם כשהאפליקציה סגורה, לקבלת התובנות המדויקות והאמיתיות ביותר.
ro: Включите доступ к геолокации для анализа ваших прогулок, даже когда приложение закрыто, чтобы получить наиболее точные данные о повседневной походке.

source: Two Minute Walk Test
he: בדיקת הליכה של שתי דקות
ro: 2 Мин Ходьба Тест

source: UCBL brace
he: תומך UCBL
ro: Ортез UCBL

source: Unable to complete at this time
he: לא ניתן להשלים בשלב זה
ro: Невозможно выполнить в данный момент

source: Unable to compute date for 7 days ago.
he: לא ניתן לחשב תאריך לפני 7 ימים.
ro: Невозможно вычислить дату 7 дней назад.

# Use of hands
source: Did you use hands for support?
he: האם השתמשתם בידיים לתמיכה
ro: Вы использовали руки для поддержки?

# videoLanguage
source: en
he: he

source: View instructions
he: צפו בהוראות
ro: Инструкции

source: Wait 3 seconds while sitting down.
he: המתינו 3 שניות בזמן הישיבה.
ro: Подождите 3 секунды, сидя.

source: Walk
he: הליכה
ro: Ходьба

source: Walk 3 meters towards the marker and go around it.
he: לכו 3 מטרים לכיוון הסמן והקיפו אותו.
ro: Пройдите 3 метра к маркеру и обойдите его.

source: Walk at a comfortable pace.
he: לכו בקצב נוח וטבעי.
ro: Ходите в удобном темпе.

source: Walk at a steady pace back and forth along a flat path (like a hallway).
he: לכו בקצב קבוע קדימה ואחורה לאורך מסלול שטוח (כמו מסדרון).
ro: Ходите в ровном темпе вперед назад по ровной дорожке (например, по коридору).

source: Walk back towards the chair and sit down.
he: חזרו לכיוון הכיסא והתיישבו.
ro: Вернитесь к стулу и сядьте.

source: Walk score daily average
he: ציון הליכה ממוצע יומי
ro: Среднесуточная оценка ходьбы

source: Walker
he: הליכון
ro: Ходунки

source: We access walking and activity data from HealthKit, including step count, walking speed, and other movement details, to help assess your mobility overall activity levels.
he: אנו ניגשים לנתוני הליכה ופעילות מ-אפליקציית "בריאות", כולל ספירת צעדים, מהירות הליכה ופרטי תנועה אחרים, כדי לעזור להעריך את רמות הניידות והפעילות הכוללות שלכם.
ro: Мы получаем доступ к данным о ходьбе и активности из HealthKit, включая количество шагов, скорость ходьбы и другие детали движения, чтобы помочь оценить вашу мобильность и общий уровень активности.

source: We access your phone’s motion sensors to analyze steps, balance, and how you walk. This helps us provide detailed, clinically relevant insights.
he: אנחנו ניגשים לחיישני התנועה של הטלפון שלכם כדי לנתח צעדים, שיווי משקל ואת אופן ההליכה שלכם. זה מאפשר לנו לספק תובנות מפורטות ורלוונטיות מבחינה קלינית.
ro: Мы получаем доступ к датчикам движения вашего телефона для анализа шагов, равновесия и походки. Это помогает нам предоставлять детальные, клинически значимые данные.

source: We could not detect any movement
he: לא הצלחנו לזהות תנועה
ro: Мы не смогли обнаружить никакого движения.

source: We couldn't capture enough data to generate a score.
he: לא הצלחנו לזהות מספיק נתונים כדי ליצור ציון.
ro: Нам не удалось собрать достаточно данных для формирования оценки.

source: We couldn't capture your steps
he: לא הצלחנו לזהות את הצעדים שלכם
ro: Мы не смогли зафиксировать ваши шаги

source: We couldn't detect any movement
he: לא הצלחנו לזהות תנועה
ro: Мы не смогли обнаружить никакого движения.

source: We couldn't record enough data for a full analysis.
he: לא הצלחנו להקליט מספיק נתונים לניתוח מלא.
ro: Нам не удалось записать достаточно данных для полного анализа.

source: We didn't detect repetitions
he: לא זיהינו חזרות
ro: Мы не обнаружили повторений

source: We managed to capture the number of steps but not a full gait analysis.
he: הצלחנו לזהות את מספר הצעדים אך לא ניתוח הליכה מלא.
ro: Нам удалось зафиксировать количество шагов, но не полный анализ походки.

source: We use motion-related location data during walks and other standard movement measurements. This helps us analyze your movement, but we never track or store your exact location.
he: אנו משתמשים בנתוני מיקום הקשורים לתנועה במהלך הליכות ומדידות תנועה סטנדרטיות אחרות. זה עוזר לנו לנתח את התנועה שלכם, אך אנחנו לעולם לא עוקבים או שומרים את המיקום המדויק שלכם.
ro: Мы используем данные о геолокации, связанные с движением, во время прогулок и других стандартных измерений движения. Это помогает нам анализировать ваши движения, но мы никогда не отслеживаем и не сохраняем ваше точное местоположение.

source: We will tell you when to start and stop.
he: נגיד לכם מתי להתחיל ולעצור.
ro: Мы скажем вам, когда начинать и останавливаться.

source: We will verbally guide you through the rest of this activity.
he: נדריך אותך בעל פה בשאר הפעילות הזו.
ro: Мы устно проведем вас через оставшуюся часть этого упражнения.

source: What assistive device did you use?
he: באיזה אביזר עזר השתמשתם?
ro: Какое вспомогательное устройство вы использовали?

source: When prompted, select
he: כאשר תתבקשו, בחרו
ro: При появлении запроса выберите

source: Which type of footwear was worn during the test?
he: איזה סוג נעליים נעלתם במהלך הבדיקה?
ro: Какой тип обуви был надет во время теста?

source: With shoes
he: עם נעליים
ro: В обуви

# yesUsedHands
source: Yes
he: כן
ro: Использовал(а) руки

source: You are halfway done.
he: חצי דרך מאחוריכם.
ro: Вы прошли половину пути.

source: You did great! We encountered a problem in loading additional insights.
he: עשית עבודה מצוינת! נתקלנו בבעיה בטעינת תובנות נוספות.
ro: Вы отлично справились! Мы столкнулись с проблемой при загрузке дополнительных выводов.

source: You have 4 minutes to go.
he: נותרו לכם ארבע דקות.
ro: У вас осталось четыре минуты.

source: You have 5 minutes to go.
he: נותרו לכם חמש דקות.
ro: У вас осталось пять минут.

source: You have 15 seconds to go.
he: נותרו לכם חמש עשרה שניות.
ro: У вас осталось пятнадцать секунд.

source: You have only 2 minutes left.
he: נותרו לכם שתי דקות בלבד.
ro: У вас осталось всего две минуты.

source: You may use a walking aid if needed.
he: ניתן להשתמש באמצעי עזר להליכה במידת הצורך.
ro: При необходимости можно использовать вспомогательное средство для ходьбы.

source: You only have 1 minute to go.
he: נותרה לכם דקה אחת בלבד.
ro: У вас осталась одна минута.

source: Your background monitoring is currently off.
he: ניטור הרקע שלכם כרגע כבוי.
ro: Ваш фоновый мониторинг в настоящее время отключен.

source: Your data is safe with us
he: הנתונים שלכם בטוחים איתנו
ro: Ваши данные в безопасности с нами

source: Your data is securely stored and shared only with your healthcare provider.
he: המידע שלכם נשמר באופן מאובטח ומשותף רק עם הגורם המטפל ללא מעקב או שמירה של מיקום מדויק.
ro: Ваши данные надежно хранятся и передаются только вашему лечащему врачу.

source: Your provider cannot monitor your measurements before you allow access to your location.
he: הספק שלכם לא יכול לנטר את המדידות שלכם לפני שתאפשר גישה למיקום שלכם.
ro: Ваш провайдер не может отслеживать ваши измерения, пока вы не разрешите приложению доступ к геолокации.

source: Your results are being processed. You can continue using the app, and your analysis will appear in your History tab shortly.
he: התוצאות שלכם מעובדות. אפשר להמשיך להשתמש באפליקציה, והניתוח יופיע בקרוב בלשונית ההיסטוריה.
ro: Ваши результаты обрабатываются. Вы можете продолжить пользоваться приложением, и анализ скоро появится на вкладке «История».

source: Your session has expired. Please close and reopen the app — it will reconnect automatically.
he: אנא סגרו ופתחו מחדש את האפליקציה — היא תתחבר מחדש באופן אוטומטי.
ro: Пожалуйста, закройте и снова откройте приложение — оно подключится автоматически.

source: Your walk had too many turns
he: להליכה שלכם היו יותר מדי סיבובים
ro: Ваша прогулка имела слишком много поворотов.

source: Tap “Start” to begin the test.
ro: Нажмите “Старт”, чтобы начать тест.

source: What is the patient’s level of assistance?
ro: Каков уровень оказания помощи пациенту?
